<a href="https://colab.research.google.com/github/jenavishal/Python4DS/blob/vmaster/Assignment_2_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [100]:
import numpy as np
import pandas as pd
#q1:- import the dataset into dataframe?
df = pd.read_csv("/content/drive/My Drive/csv files/Salaries.csv")
df

            Id       EmployeeName  ...         Agency  Status
0            1     NATHANIEL FORD  ...  San Francisco     NaN
1            2       GARY JIMENEZ  ...  San Francisco     NaN
2            3     ALBERT PARDINI  ...  San Francisco     NaN
3            4  CHRISTOPHER CHONG  ...  San Francisco     NaN
4            5    PATRICK GARDNER  ...  San Francisco     NaN
...        ...                ...  ...            ...     ...
148649  148650      Roy I Tillery  ...  San Francisco     NaN
148650  148651       Not provided  ...  San Francisco     NaN
148651  148652       Not provided  ...  San Francisco     NaN
148652  148653       Not provided  ...  San Francisco     NaN
148653  148654          Joe Lopez  ...  San Francisco     NaN

[148654 rows x 13 columns]

In [101]:
#q2:-Display the column names?
df.columns

Index(['Id', 'EmployeeName', 'JobTitle', 'BasePay', 'OvertimePay', 'OtherPay',
       'Benefits', 'TotalPay', 'TotalPayBenefits', 'Year', 'Notes', 'Agency',
       'Status'],
      dtype='object')

In [102]:
#q3:-display the number of rows and cols?
#no_of_columns:-
no_of_columns = len(df.columns)
no_of_columns

13

In [103]:
# no_of_rows:-
no_of_rows = len(df.index)
no_of_rows

148654

In [104]:
#q3:-display the dataframe info (types of data in columns and not null values etc.)?
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 148654 entries, 0 to 148653
Data columns (total 13 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Id                148654 non-null  int64
 1   EmployeeName      148654 non-null  object
 2   JobTitle          148654 non-null  object
 3   BasePay           148045 non-null  float64
 4   OvertimePay       148650 non-null  float64
 5   OtherPay          148650 non-null  float64
 6   Benefits          112491 non-null  float64
 7   TotalPay          148654 non-null  float64
 8   TotalPayBenefits  148654 non-null  float64
 9   Year              148654 non-null  int64
 10  Notes             0 non-null       float64
 11  Agency            148654 non-null  object
 12  Status            0 non-null       float64
dtypes: float64(8), int64(2), object(3)
memory usage: 14.7+ MB

In [105]:
#q4:-display stats of the dataframe like count, mean, std, max, 25% etc.....?
df.describe()

                  Id        BasePay  ...  Notes  Status
count  148654.000000  148045.000000  ...    0.0     0.0
mean    74327.500000   66325.448841  ...    NaN     NaN
std     42912.857795   42764.635495  ...    NaN     NaN
min         1.000000    -166.010000  ...    NaN     NaN
25%     37164.250000   33588.200000  ...    NaN     NaN
50%     74327.500000   65007.450000  ...    NaN     NaN
75%    111490.750000   94691.050000  ...    NaN     NaN
max    148654.000000  319275.010000  ...    NaN     NaN

[8 rows x 10 columns]

In [106]:
#q5:-display null values per column?
df.isnull().sum()            # sum() will return the no of NaN values per column

Id                       0
EmployeeName             0
JobTitle                 0
BasePay                609
OvertimePay              4
OtherPay                 4
Benefits             36163
TotalPay                 0
TotalPayBenefits         0
Year                     0
Notes               148654
Agency                   0
Status              148654
dtype: int64

In [107]:
#q6:-remove columns with all values as NaN?
# see in above output showing no of nan values ,as there are total 148654 rows and column 'notes','statues' have all values null
# i.e removing notes and status
df.drop(['Notes','Status'],axis=1)

            Id       EmployeeName  ...  Year         Agency
0            1     NATHANIEL FORD  ...  2011  San Francisco
1            2       GARY JIMENEZ  ...  2011  San Francisco
2            3     ALBERT PARDINI  ...  2011  San Francisco
3            4  CHRISTOPHER CHONG  ...  2011  San Francisco
4            5    PATRICK GARDNER  ...  2011  San Francisco
...        ...                ...  ...   ...            ...
148649  148650      Roy I Tillery  ...  2014  San Francisco
148650  148651       Not provided  ...  2014  San Francisco
148651  148652       Not provided  ...  2014  San Francisco
148652  148653       Not provided  ...  2014  San Francisco
148653  148654          Joe Lopez  ...  2014  San Francisco

[148654 rows x 11 columns]

In [108]:
#q7:-display number of unique values in each column?
for columns in df:              # access all columns in df usinfg for loop
  print(columns,":-",df[columns].nunique())             # getting no of unique values in each column

Id :- 148654
EmployeeName :- 110811
JobTitle :- 2159
BasePay :- 109489
OvertimePay :- 65998
OtherPay :- 83225
Benefits :- 98465
TotalPay :- 138486
TotalPayBenefits :- 142098
Year :- 4
Notes :- 0
Agency :- 1
Status :- 0

In [109]:
#q8:-mean of total pay of all people based on year?
df.groupby('Year').mean()['TotalPay']

Year
2011    71744.103871
2012    74113.262265
2013    77611.443142
2014    75463.918140
Name: TotalPay, dtype: float64

In [137]:
#q9:-how many people have 0 overtime pay?
df['OvertimePay'].value_counts()[0]        #[0] will give the values or no of people having 0 overtimepay

77321

In [148]:
#q13:-how many people have BasePay > 150000 and OvertimePay > 100000?
n = df[(df['BasePay']>150000) & (df['OvertimePay']>100000)]['EmployeeName']
print("no of people have BasePay > 150000 and OvertimePay > 100000 is ",len(n))

no of people have BasePay > 150000 and OvertimePay > 100000 is  12